In [1]:
# %load test_2.py

"根据官方教材来解题"

#data analysis and wrangling
import pandas as pd
import numpy as np
import random as rnd
import math

#visualization
import seaborn as sns
import matplotlib.pyplot as plt

#machine leanring
from sklearn.linear_model import LogisticRegression
from sklearn.svm import SVC,LinearSVC
from sklearn.ensemble import RandomForestClassifier
from sklearn.neighbors import KNeighborsClassifier
from sklearn.naive_bayes import GaussianNB
from sklearn.linear_model import Perceptron
from sklearn.linear_model import SGDClassifier
from sklearn.tree import DecisionTreeClassifier

pd.set_option('display.max_columns',None)

train_df = pd.read_csv('data/train.csv')
test_df = pd.read_csv('data/train.csv')
combine = [train_df,test_df]

In [19]:
# 熟悉数据
# print(train_df.columns.values)

#preview the data
#train_df.head()
#train_df.tail()
# train_df.describe()
# train_df.Name

# train_df[train_df.Name.str.contains('Lady')].Name

# # 年龄为空（NaN）的人
# train_df[train_df.Age != train_df.Age]
train_df[train_df.Embarked != train_df.Embarked]

     Survived  Pclass  Sex  Age  Fare Embarked Title  IsAlone
61          1       1    1    2  80.0      NaN  Miss        1
829         1       1    1    3  80.0      NaN   Mrs        1

In [3]:
# # 数据分析图
# # 船舱（Pclass）与生存率之间的关系
# train_df[['Pclass','Survived']].groupby(['Pclass'],as_index=False).mean().sort_values(by='Survived',ascending=False)
# # 性别与生存率之间的关系
# train_df[["Sex", "Survived"]].groupby(['Sex'], as_index=False).mean().sort_values(by='Survived', ascending=False)
# # 兄弟姐妹个数与生存率之间的关系
# train_df[["SibSp", "Survived"]].groupby(['SibSp'], as_index=False).mean().sort_values(by='Survived', ascending=False)
# # 父母孩子个数与生存率时间的关系
# train_df[["Parch", "Survived"]].groupby(['Parch'], as_index=False).mean().sort_values(by='Survived', ascending=False)

# # 两种Survived的年龄分布直方图
# g = sns.FacetGrid(train_df, col='Survived')
# g.map(plt.hist, 'Age', bins=20)

# # 是否Survived和三种Pclass的年龄分布直方图
# # grid = sns.FacetGrid(train_df, col='Pclass', hue='Survived')
# grid = sns.FacetGrid(train_df, col='Survived', row='Pclass', size=2.2, aspect=1.6)
# grid.map(plt.hist, 'Age', alpha=.5, bins=20)
# grid.add_legend();

# # 两种性别和三个Embarked（登船港口）的生存率关系图
# # grid = sns.FacetGrid(train_df, col='Embarked')
# grid = sns.FacetGrid(train_df, row='Embarked', size=2.2, aspect=1.6)
# grid.map(sns.pointplot, 'Pclass', 'Survived', 'Sex', palette='deep')
# grid.add_legend()

# # 是否Survived和三个Embarked（登船港口）的性别分布直方图
# # grid = sns.FacetGrid(train_df, col='Embarked', hue='Survived', palette={0: 'k', 1: 'w'})
# grid = sns.FacetGrid(train_df, row='Embarked', col='Survived', size=2.2, aspect=1.6)
# grid.map(sns.barplot, 'Sex', 'Fare', alpha=.5, ci=None)
# grid.add_legend()

# # 三种船舱和两种性别的年龄直方图
# # grid = sns.FacetGrid(train_df, col='Pclass', hue='Gender')
# grid = sns.FacetGrid(train_df, row='Pclass', col='Sex', size=2.2, aspect=1.6)
# grid.map(plt.hist, 'Age', alpha=.5, bins=20)
# grid.add_legend()

In [6]:
# 去掉Ticket和Cabin，暂时认为船票信息和船舱信息与生存率无关
print("Before", train_df.shape, test_df.shape, combine[0].shape, combine[1].shape)

train_df = train_df.drop(['Ticket', 'Cabin'], axis=1)
test_df = test_df.drop(['Ticket', 'Cabin'], axis=1)
combine = [train_df, test_df]

"After", train_df.shape, test_df.shape, combine[0].shape, combine[1].shape

Before (891, 12) (891, 12) (891, 12) (891, 12)

('After', (891, 10), (891, 10), (891, 10), (891, 10))

In [8]:
# 新增feture Title
for dataset in combine:
    dataset['Title'] = dataset.Name.str.extract(' ([A-Za-z]+)\.', expand=False)
# 每个称谓的分布情况
pd.crosstab(train_df['Title'], train_df['Sex'])

Sex       female  male
Title
Capt           0     1
Col            0     2
Countess       1     0
Don            0     1
Dr             1     6
Jonkheer       0     1
Lady           1     0
Major          0     2
Master         0    40
Miss         182     0
Mlle           2     0
Mme            1     0
Mr             0   517
Mrs          125     0
Ms             1     0
Rev            0     6
Sir            0     1

In [9]:
# 把称谓进行分类
for dataset in combine:
# 1.Lady 和 Sir 可以认为是英国皇家中男女的称呼。在数据集中有2名，且他们是夫妇（Duff Gordon 夫妇），皇家爵位是男爵；
# 2.Countess 皇家称为，伯爵夫人或女伯爵。在数据集中有1名；
# 3.Capt 船长; captain （陆军）上尉; （海军） 上校。1名，在数据集中他是陆军上尉；
# 4.Col 上校。2名；
# 5.Don 基督教男子教名。1名->Mr；
# 6.Dr 博士,医生。6名；
# 7.Major 陆军少校。2名；
# 8.Rev 牧师。6名；
# 9.Jonkheer 低级贵族。1名；

    dataset['Title'] = dataset['Title'].replace(['Lady', 'Countess','Capt', 'Col',\
 	'Don', 'Dr', 'Major', 'Rev', 'Sir', 'Jonkheer', 'Dona'], 'Rare')

    dataset['Title'] = dataset['Title'].replace('Mlle', 'Miss')
    dataset['Title'] = dataset['Title'].replace('Ms', 'Miss')
    dataset['Title'] = dataset['Title'].replace('Mme', 'Mrs')

    
train_df[['Title', 'Survived']].groupby(['Title'], as_index=False).mean()

    Title  Survived
0  Master  0.575000
1    Miss  0.702703
2      Mr  0.156673
3     Mrs  0.793651
4    Rare  0.347826

In [39]:
# 根据Name 把 Title分成5类
title_mapping = {"Mr": 1, "Miss": 2, "Mrs": 3, "Master": 4, "Rare": 5}
for dataset in combine:
    dataset['Title'] = dataset['Title'].map(title_mapping)
    dataset['Title'] = dataset['Title'].fillna(0)

train_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked,Title
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500,S,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C,3
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,7.9250,S,2
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000,S,3
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,8.0500,S,1

In [10]:
#删除Name属性
train_df = train_df.drop(['Name', 'PassengerId'], axis=1)
test_df = test_df.drop(['Name'], axis=1)
combine = [train_df, test_df]
train_df.shape, test_df.shape

((891, 9), (891, 10))

In [11]:
#把性别转为 1和0
for dataset in combine:
    dataset['Sex'] = dataset['Sex'].map( {'female': 1, 'male': 0} ).astype(int)

train_df.head()

   Survived  Pclass  Sex   Age  SibSp  Parch     Fare Embarked Title
0         0       3    0  22.0      1      0   7.2500        S    Mr
1         1       1    1  38.0      1      0  71.2833        C   Mrs
2         1       3    1  26.0      0      0   7.9250        S  Miss
3         1       1    1  35.0      1      0  53.1000        S   Mrs
4         0       3    0  35.0      0      0   8.0500        S    Mr

In [12]:
# 对年龄为空的样本，设置年龄（这里用中位数的方法）
guess_ages = np.zeros((2,3))
guess_ages

for dataset in combine:
    for i in range(0, 2):
        for j in range(0, 3):
            guess_df = dataset[(dataset['Sex'] == i) & \
                                  (dataset['Pclass'] == j+1)]['Age'].dropna()

            # age_mean = guess_df.mean()
            # age_std = guess_df.std()
            # age_guess = rnd.uniform(age_mean - age_std, age_mean + age_std)
            
            #取中位数
            age_guess = guess_df.median()

            # Convert random age float to nearest .5 age
            guess_ages[i,j] = int( age_guess/0.5 + 0.5 ) * 0.5
            
    for i in range(0, 2):
        for j in range(0, 3):
            dataset.loc[ (dataset.Age.isnull()) & (dataset.Sex == i) & (dataset.Pclass == j+1),\
                    'Age'] = guess_ages[i,j]

    dataset['Age'] = dataset['Age'].astype(int)

train_df.head()

   Survived  Pclass  Sex  Age  SibSp  Parch     Fare Embarked Title
0         0       3    0   22      1      0   7.2500        S    Mr
1         1       1    1   38      1      0  71.2833        C   Mrs
2         1       3    1   26      0      0   7.9250        S  Miss
3         1       1    1   35      1      0  53.1000        S   Mrs
4         0       3    0   35      0      0   8.0500        S    Mr

In [13]:
# 新增feture AgeBand，把年龄从低到高分为5个区间
train_df['AgeBand'] = pd.cut(train_df['Age'], 5)
train_df[['AgeBand', 'Survived']].groupby(['AgeBand'], as_index=False).mean().sort_values(by='AgeBand', ascending=True)

         AgeBand  Survived
0  (-0.08, 16.0]  0.550000
1   (16.0, 32.0]  0.337374
2   (32.0, 48.0]  0.412037
3   (48.0, 64.0]  0.434783
4   (64.0, 80.0]  0.090909

In [14]:
# 根据5个年龄段，把各个年龄替换为0~4
for dataset in combine:    
    dataset.loc[ dataset['Age'] <= 16, 'Age'] = 0
    dataset.loc[(dataset['Age'] > 16) & (dataset['Age'] <= 32), 'Age'] = 1
    dataset.loc[(dataset['Age'] > 32) & (dataset['Age'] <= 48), 'Age'] = 2
    dataset.loc[(dataset['Age'] > 48) & (dataset['Age'] <= 64), 'Age'] = 3
    dataset.loc[ dataset['Age'] > 64, 'Age']
train_df.head()

,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,Title,AgeBand
0,0,3,0,1,1,0,7.2500,S,Mr,"(16.0, 32.0]"
1,1,1,1,2,1,0,71.2833,C,Mrs,"(32.0, 48.0]"
2,1,3,1,1,0,0,7.9250,S,Miss,"(16.0, 32.0]"
3,1,1,1,2,1,0,53.1000,S,Mrs,"(32.0, 48.0]"
4,0,3,0,2,0,0,8.0500,S,Mr,"(32.0, 48.0]"

In [15]:
# 删除AgeBand属性
train_df = train_df.drop(['AgeBand'], axis=1)
combine = [train_df, test_df]
train_df.head()

   Survived  Pclass  Sex  Age  SibSp  Parch     Fare Embarked Title
0         0       3    0    1      1      0   7.2500        S    Mr
1         1       1    1    2      1      0  71.2833        C   Mrs
2         1       3    1    1      0      0   7.9250        S  Miss
3         1       1    1    2      1      0  53.1000        S   Mrs
4         0       3    0    2      0      0   8.0500        S    Mr

In [16]:
# 新增feture FamilySize，家庭成员数量与存活率的关系
for dataset in combine:
    dataset['FamilySize'] = dataset['SibSp'] + dataset['Parch'] + 1

train_df[['FamilySize', 'Survived']].groupby(['FamilySize'], as_index=False).mean().sort_values(by='Survived', ascending=False)

   FamilySize  Survived
3           4  0.724138
2           3  0.578431
1           2  0.552795
6           7  0.333333
0           1  0.303538
4           5  0.200000
5           6  0.136364
7           8  0.000000
8          11  0.000000

In [17]:
# 新增feture IsAlone，是否独自和存活率的关系
for dataset in combine:
    dataset['IsAlone'] = 0
    dataset.loc[dataset['FamilySize'] == 1, 'IsAlone'] = 1

train_df[['IsAlone', 'Survived']].groupby(['IsAlone'], as_index=False).mean()

   IsAlone  Survived
0        0  0.505650
1        1  0.303538

In [18]:
# 这里删除家庭成员相关属性，认为它们与存活率没有什么联系
train_df = train_df.drop(['Parch', 'SibSp', 'FamilySize'], axis=1)
test_df = test_df.drop(['Parch', 'SibSp', 'FamilySize'], axis=1)
combine = [train_df, test_df]

train_df.head()

   Survived  Pclass  Sex  Age     Fare Embarked Title  IsAlone
0         0       3    0    1   7.2500        S    Mr        0
1         1       1    1    2  71.2833        C   Mrs        0
2         1       3    1    1   7.9250        S  Miss        1
3         1       1    1    2  53.1000        S   Mrs        0
4         0       3    0    2   8.0500        S    Mr        1

In [ ]:
# # 年龄和船舱的乘积作为新feture，好像没看出有什么用
# for dataset in combine:
#     dataset['Age*Class'] = dataset.Age * dataset.Pclass

# train_df.loc[:, ['Age*Class', 'Age', 'Pclass']].head(10)

In [20]:
# 查出最多的登船港口
freq_port = train_df.Embarked.dropna().mode()[0]
freq_port

# 用最多出现的Embarked填充Embarked为空的数据
for dataset in combine:
    dataset['Embarked'] = dataset['Embarked'].fillna(freq_port)
    
train_df[['Embarked', 'Survived']].groupby(['Embarked'], as_index=False).mean().sort_values(by='Survived', ascending=False)

  Embarked  Survived
0        C  0.553571
1        Q  0.389610
2        S  0.339009

In [21]:
# 把Embarked转化为数字特征
for dataset in combine:
    dataset['Embarked'] = dataset['Embarked'].map( {'S': 0, 'C': 1, 'Q': 2} ).astype(int)

train_df.head()

   Survived  Pclass  Sex  Age     Fare  Embarked Title  IsAlone
0         0       3    0    1   7.2500         0    Mr        0
1         1       1    1    2  71.2833         1   Mrs        0
2         1       3    1    1   7.9250         0  Miss        1
3         1       1    1    2  53.1000         0   Mrs        0
4         0       3    0    2   8.0500         0    Mr        1

In [22]:
# 用Fare中间数填充Fare为空的数据
test_df['Fare'].fillna(test_df['Fare'].dropna().median(), inplace=True)
test_df.head()

   PassengerId  Survived  Pclass  Sex  Age     Fare  Embarked Title  IsAlone
0            1         0       3    0    1   7.2500         0    Mr        0
1            2         1       1    1    2  71.2833         1   Mrs        0
2            3         1       3    1    1   7.9250         0  Miss        1
3            4         1       1    1    2  53.1000         0   Mrs        0
4            5         0       3    0    2   8.0500         0    Mr        1

In [23]:
# 新增FareBand，票价区间
train_df['FareBand'] = pd.qcut(train_df['Fare'], 4)
train_df[['FareBand', 'Survived']].groupby(['FareBand'], as_index=False).mean().sort_values(by='FareBand', ascending=True)

          FareBand  Survived
0   (-0.001, 7.91]  0.197309
1   (7.91, 14.454]  0.303571
2   (14.454, 31.0]  0.454955
3  (31.0, 512.329]  0.581081

In [ ]:
# 根据票价区间，把Fare替换为0~3四类
for dataset in combine:
    dataset.loc[ dataset['Fare'] <= 7.91, 'Fare'] = 0
    dataset.loc[(dataset['Fare'] > 7.91) & (dataset['Fare'] <= 14.454), 'Fare'] = 1
    dataset.loc[(dataset['Fare'] > 14.454) & (dataset['Fare'] <= 31), 'Fare']   = 2
    dataset.loc[ dataset['Fare'] > 31, 'Fare'] = 3
    dataset['Fare'] = dataset['Fare'].astype(int)

train_df = train_df.drop(['FareBand'], axis=1)
combine = [train_df, test_df]
    
train_df.head(10)